papers/first-afference/protocol_v5_redteam/round4/verify-exam/exam-mut-hop-close-drops-closer-hook/mutant.patch
--- /home/user/styxx-1/styxx/protocol.py	2026-09-25 02:35:49.101149144 +0000
+++ /tmp/claude-0/-home-user/1230efe6-3e44-5eb6-ad91-35910fea5db9/scratchpad/rt4/verify-exam/exam-mut-hop-close-drops-closer-hook/styxx/protocol.py	2026-09-25 05:11:20.173075902 +0000
@@ -1075,7 +1075,7 @@
                 st[0] -= 1
                 if st[0] <= 0:
                     del _THREADS[o.tid]
-                    if tid == o.tid and sys.getprofile() is _hook:
+                    if sys.getprofile() is _hook:
                         sys.setprofile(None)
             o.end = end
 
