papers/first-afference/protocol_v5_redteam/round4/verify-exam/exam-mut-problems-before-bad-count/exam-mut-problems-before-bad-count_mutant.diff
--- a/styxx/protocol.py
+++ b/styxx/protocol.py
@@ -549,13 +549,6 @@
             raise GateSpecError(
                 f"[V5:TARGET_SET] gate {name!r}: the trace's target set {sorted(tr['targets'])} "
                 f"differs from the declared set {self.coverage_targets}")
-        declared = set(self.coverage_targets)
-        for where, d in _count_dicts(tr):
-            for t, n in d.items():
-                if t not in declared or type(n) is not int or n < 1:
-                    raise GateSpecError(
-                        f"[V5:BAD_COUNT] gate {name!r}: {where} holds {t!r}: {n!r}; counts are "
-                        f"declared targets with integer values >= 1")
         problems = tr["problems"]
         if problems:
             first = _CODE_RE.match(problems[0]).group(1)
@@ -576,6 +569,13 @@
                 raise GateSpecError(f"[V5:CLONE_ALIVE] gate {name!r}: {problems[0]}{listed}")
             if first == "CODE_SWAPPED":
                 raise GateSpecError(f"[V5:CODE_SWAPPED] gate {name!r}: {problems[0]}{listed}")
+        declared = set(self.coverage_targets)
+        for where, d in _count_dicts(tr):
+            for t, n in d.items():
+                if t not in declared or type(n) is not int or n < 1:
+                    raise GateSpecError(
+                        f"[V5:BAD_COUNT] gate {name!r}: {where} holds {t!r}: {n!r}; counts are "
+                        f"declared targets with integer values >= 1")
         openings = tr["sections"].get(c["section"])
         if openings is None:
             raise GateSpecError(
