papers/first-afference/protocol_v5_redteam/round4/verify-exam/examhole-class-step-exact-type/mutant.patch
--- a/styxx/protocol.py
+++ b/styxx/protocol.py
@@ -820,7 +820,7 @@
                 raise GateSpecError(
                     f"[V5:UNRESOLVED] declared target {target!r}: {mod_name!r} has no attribute "
                     f"{part!r} and no module __getattr__ (an unimported submodule is not an attribute)")
-        elif isinstance(obj, type):
+        elif type(obj) is type:
             own = vars(obj)
             if part in own:
                 holder, obj = own, own[part]
