papers/first-afference/protocol_v5_redteam/round4/verify-exam/examhole-module-step-exact-type/mutant.patch
--- a/styxx/protocol.py
+++ b/styxx/protocol.py
@@ -801,7 +801,7 @@
             f"{type(e).__name__}: {e}") from e
     obj, holder = mod, None
     for i, part in enumerate(qual.split(".")):
-        if isinstance(obj, types.ModuleType):
+        if type(obj) is types.ModuleType:
             if i > 0:
                 raise GateSpecError(
                     f"[V5:INSTANCE_PATH] declared target {target!r}: {part!r} is reached through the "
